def area(a, b):
    """
    Вычисляет площадь прямоугольника
    
    Площадь прямоугольника: S = a * b
    
    Параметры:
        a (float): длина первой стороны прямоугольника
        b (float): длина второй стороны прямоугольника
    
    Возвращаемое значение:
        float: площадь прямоугольника
    """
    return a * b

def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника
    
    Периметр прямоугольника: P = 2(a + b)
    
    Параметры:
        a (float): длина первой стороны прямоугольника
        b (float): длина второй стороны прямоугольника
    
    Возвращаемое значение:
        float: периметр прямоугольника
    """

    return 2 * (a + b)
